# Задача:
# 
# Создать класс Человек
# 
# У человека есть свойства:
# Имя
# Возраст
# Cытость, максимум 100, минимум 0
# деньги минимум 0
# счастье минимум 0, максимум 100
# 
# Человек может: есть (+50 сытости, +20 счастья, -20 еды), спать (+50 счастья, -20 сытости), ходить на работу(+100 денег, - 40 счастья), играть на компьютере(+60 счастья, - 20 сытости), ходить в магазин(+50 еды, - 20 счастья, - 20 сытости, -50 денег)
# Человек умрет если: голод упал до 0, счастье упало до 0
# 
# Написать симуляцию жизни человека
# Одно действие человека затрачивает 1 день (пока что так)
# Возраст человека меняется каждые 365 дней
# 
# Каждый день выводить информацию в формате:
# Номер дня
# Имя - Возраст
# Счастье - 
# Сытость - 
# Деньги - 
# 
# Если человек умер вывести информацию от чего он умер:
# Номер дня
# {Имя} умер от {Причина}


# Доп задача:
# Почитать про ООП - Инкапсуляция, Наследование, Полиморфизм
# Почитать про классы в питоне - инициализация, свойства, методы, имплементация объекта класса
# 
# Пушить написанный код в гит
# 
